user/tutorials/Nike/TemporalMixingLayer_2d_new2/system/internalProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified list of points.

\*---------------------------------------------------------------------------*/

/*//Points output
fields (p);
points
(
    (1.e-03 0 0)
    (10.e-03 0 0)
    (100.e-03 0 0)
);

interpolationScheme cell;
setFormat	csv;

type            sets;
libs            ("libsampling.so");

executeControl  timeStep;
writeControl    timeStep;

sets
(
    points
    {
        type    points;
        axis    x;//xyz;
        points  $points;
        ordered     on;
    }
    
);
*/


fields (p T U thermo:rho vaporfrac soundspeed);

interpolationScheme cell;
setFormat	csv;

type            sets;
libs            ("libsampling.so");

executeControl  timeStep;
writeControl    writeTime;


sets
(
    lineCell
    {
        type    lineCell;
        axis    x;//xyz;
        start   (0 0 0);
        end     (1.04 0 0);
        ordered     on;
    }
    
);

// ************************************************************************* //
